using UnityEngine;
using System;





class CBeAtkBehavior : CBehavior
{



	public CBeAtkBehavior()
	{
		
	}
	
	~CBeAtkBehavior()
	{
		
	}
	

	//-----------------------------------------------------------------------------------------
	// 进入本行为
	//-----------------------------------------------------------------------------------------
	public override void Enter( uint dwParam )
	{
		// 被攻击欣慰
		if (m_CtrlSkelton != null) 
		{

			if( m_CtrlSkelton.m_nCurPlayActID != ACTID.ACT_Damage01 )
			{
				m_CtrlSkelton.PlayTrack( ACTID.ACT_Damage01 );
			}
			else
			{
				m_CtrlSkelton.PlayTrack( ACTID.ACT_Damage02 );
			}
		}
	}
	
	//-----------------------------------------------------------------------------------------
	// 退出本行为
	//-----------------------------------------------------------------------------------------
	public override void Exit()
	{
		
	}
	
	//-----------------------------------------------------------------------------------------
	// 退出本行为
	//-----------------------------------------------------------------------------------------
	public override void Update( )
	{
		
	}

	//-----------------------------------------------------------------------------------------
	// 处理动作底层发来的事件
	//-----------------------------------------------------------------------------------------
	public override void doAnimEvent(  string strParam )
	{
		
	}
}

