
using UnityEngine;
using System;




/**	\class CSoporBehavior
	\brief NPC昏睡状态
*/
class CSoporBehavior : CBehavior
{
	
	public CSoporBehavior()
	{
		
	}
	
	~CSoporBehavior()
	{
		
	}
	
	
	//-----------------------------------------------------------------------------------------
	// 进入本行为
	//-----------------------------------------------------------------------------------------
	public override void Enter( uint dwParam )
	{
		
	}
	
	//-----------------------------------------------------------------------------------------
	// 退出本行为
	//-----------------------------------------------------------------------------------------
	public override void Exit()
	{
		
	}
	
	//-----------------------------------------------------------------------------------------
	// 退出本行为
	//-----------------------------------------------------------------------------------------
	public override void Update( )
	{
		
	}

	//-----------------------------------------------------------------------------------------
	// 处理动作底层发来的事件
	//-----------------------------------------------------------------------------------------
	public override void doAnimEvent(  string strParam )
	{
		
	}
	
	//-----------------------------------------------------------------------------------------
	// 退出本行为
	//-----------------------------------------------------------------------------------------
	float	AngleAroundAxis( Vector3 dirA, Vector3 dirB, Vector3 axis )
	{
		dirA 		= dirA - Vector3.Project (dirA, axis);
		dirB 		= dirB - Vector3.Project (dirB, axis);
		
		float angle = Vector3.Angle (dirA, dirB);
		return angle * (Vector3.Dot( axis, Vector3.Cross( dirA, dirB )) < 0 ? -1: 1 );
	}
}





