/*
 * ----------------------------------------------------------------------------------------------
 *          file name : Node.cs 
 *          desc      : 地形块
 *          author    : 李江坡
 *          log       : by ljp 创建 [ 2015-12-27 
 *                    : 地形格子节点对象
 * ----------------------------------------------------------------------------------------------         
*/
using System;
using System.Collections.Generic;



public class CNode : IComparable<CNode>
{

    
    /// -----------------------------------------------------------------------------------------
    /// <summary>
    /// 地形Node 节点管理的数据类型枚举
    /// </summary>
    /// -----------------------------------------------------------------------------------------
    public enum BUILDTYPE
    {
        BT_INVALIDE         = -1,

    };


    #region Fields
    private BUILDTYPE       m_build;
    private CNode           m_parent;
    private int             m_index;
    #endregion
    
    
    /// -----------------------------------------------------------------------------------------
    /// <summary>
    /// 地面防止物体的类型
    /// </summary>
    /// ----------------------------------------------------------------------------------------
    public BUILDTYPE  Build
    {
        get { return m_build; }
        set { m_build = value; }
    }


    /// -----------------------------------------------------------------------------------------
    /// <summary>
    /// 节点的父亲节点
    /// </summary>
    /// ----------------------------------------------------------------------------------------
    public CNode Parent
    {
        get { return m_parent; }
        set { m_parent = value; }
    }


    /// -----------------------------------------------------------------------------------------
    /// <summary>
    /// 地面防止物体的类型
    /// </summary>
    /// ----------------------------------------------------------------------------------------
    public int Index
    {
        get { return m_index; }
        set { m_index = value; }
    }

    /// -----------------------------------------------------------------------------------------
    /// <summary>
    /// 初始化节点的数据信息
    /// </summary>
    /// ----------------------------------------------------------------------------------------
    public void Awake( int _index, BUILDTYPE etype )
    {
        m_index         = _index;
        m_parent        = null;
        m_build         = etype;
    }


    public int CompareTo(CNode other)
    {
        if( Index == other.Index )
        {
            return 0;
        }

        else if( Index < other.Index )
        {
            return -1;
        }

        else
        {
            return 1;
        }
    }
}

